Revit 2027 API
BoundingBoxIsInsideFilter(Outline, Boolean) Constructor
 Constructs a new instance of a filter to match elements with a bounding box is contained by the given Outline, with the option to invert the filter and match all elements with a bounding box that are not contained by the given Outline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BoundingBoxIsInsideFilter(
	Outline outline,
	bool inverted
)
Public Sub New (
	outline As Outline,
	inverted As Boolean
)
public:
BoundingBoxIsInsideFilter(
	Outline^ outline,
	bool inverted
)
new :
        outline : Outline *
        inverted : bool -> BoundingBoxIsInsideFilter
Parameters
outline Outline
 The Outline used to find elements with a bounding box that are contained by it.
inverted Boolean
 True if the filter should be inverted and match all elements with a bounding box that are not contained by the given Outline.
Exceptions
Exception | Condition
ArgumentException |  outline is an empty Outline.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BoundingBoxIsInsideFilter Class
BoundingBoxIsInsideFilter Overload
Autodesk.Revit.DB Namespace